In [1]:
import pandas as pd
import numpy as np

## Creating a DataFrame from a Dictionary

In [2]:
data = {
    'Name': ['John', 'Emma', 'Lisa', 'David'],
    'Age': [25, 28, 22, 30],
    'City': ['New York', 'London', 'Paris', 'Tokyo']
}

In [3]:
df = pd.DataFrame(data)
df

    Name  Age      City
0   John   25  New York
1   Emma   28    London
2   Lisa   22     Paris
3  David   30     Tokyo

## Creating a DataFrame from a Numpy ndarray

In [4]:
data = np.array([['John', 25, 'New York'],
                 ['Emma', 28, 'London'],
                 ['Lisa', 22, 'Paris'],
                 ['David', 30, 'Tokyo']])

In [5]:
columns = ['Name', 'Age', 'City']

In [6]:
df = pd.DataFrame(data, columns=columns)

In [7]:
df

    Name Age      City
0   John  25  New York
1   Emma  28    London
2   Lisa  22     Paris
3  David  30     Tokyo

## Exploring a DataFrame

In [8]:
df = pd.read_csv('housing.csv')

In [9]:
df.head(8)

,Suburb,Address,Rooms,Type,Price,Method,SellerG,Date,Distance,Postcode,...,Bathroom,Car,Landsize,BuildingArea,YearBuilt,CouncilArea,Lattitude,Longtitude,Regionname,Propertycount
0,Abbotsford,85 Turner St,2,h,1480000.0,S,Biggin,3/12/2016,2.5,3067.0,...,1.0,1.0,202.0,NaN,NaN,Yarra,-37.7996,144.9984,Northern Metropolitan,4019.0
1,Abbotsford,25 Bloomburg St,2,h,1035000.0,S,Biggin,4/02/2016,2.5,3067.0,...,1.0,0.0,156.0,79.0,1900.0,Yarra,-37.8079,144.9934,Northern Metropolitan,4019.0
2,Abbotsford,5 Charles St,3,h,1465000.0,SP,Biggin,4/03/2017,2.5,3067.0,...,2.0,0.0,134.0,150.0,1900.0,Yarra,-37.8093,144.9944,Northern Metropolitan,4019.0
3,Abbotsford,40 Federation La,3,h,850000.0,PI,Biggin,4/03/2017,2.5,3067.0,...,2.0,1.0,94.0,NaN,NaN,Yarra,-37.7969,144.9969,Northern Metropolitan,4019.0
4,Abbotsford,55a Park St,4,h,1600000.0,VB,Nelson,4/06/2016,2.5,3067.0,...,1.0,2.0,120.0,142.0,2014.0,Yarra,-37.8072,144.9941,Northern Metropolitan,4019.0
5,Abbotsford,129 Charles St,2,h,941000.0,S,Jellis,7/05/2016,2.5,3067.0,...,1.0,0.0,181.0,NaN,NaN,Yarra,-37.8041,144.9953,Northern Metropolitan,4019.0
6,Abbotsford,124 Yarra St,3,h,1876000.0,S,Nelson,7/05/2016,2.5,3067.0,...,2.0,0.0,245.0,210.0,1910.0,Yarra,-37.8024,144.9993,Northern Metropolitan,4019.0
7,Abbotsford,98 Charles St,2,h,1636000.0,S,Nelson,8/10/2016,2.5,3067.0,...,1.0,2.0,256.0,107.0,1890.0,Yarra,-37.8060,144.9954,Northern Metropolitan,4019.0

In [10]:
df.sample()

,Suburb,Address,Rooms,Type,Price,Method,SellerG,Date,Distance,Postcode,...,Bathroom,Car,Landsize,BuildingArea,YearBuilt,CouncilArea,Lattitude,Longtitude,Regionname,Propertycount
6445,Watsonia,56 Frensham Rd,3,h,671000.0,S,Barry,12/11/2016,14.9,3087.0,...,2.0,2.0,280.0,163.0,2002.0,Banyule,-37.7153,145.0854,Northern Metropolitan,2329.0

In [11]:
df.sample(3)

,Suburb,Address,Rooms,Type,Price,Method,SellerG,Date,Distance,Postcode,...,Bathroom,Car,Landsize,BuildingArea,YearBuilt,CouncilArea,Lattitude,Longtitude,Regionname,Propertycount
10559,Wheelers Hill,5 Rubens Ct,4,h,1035000.0,S,Win,27/05/2017,16.7,3150.0,...,2.0,2.0,702.0,NaN,NaN,Monash,-37.91075,145.18758,South-Eastern Metropolitan,7392.0
9687,Port Melbourne,58 Station St,1,h,964000.0,S,Cayzer,17/06/2017,3.5,3207.0,...,1.0,0.0,85.0,NaN,NaN,Port Phillip,-37.83710,144.93859,Southern Metropolitan,8648.0
4887,Preston,5 Kendall St,3,h,1265000.0,S,hockingstuart/Barry,4/03/2017,8.8,3072.0,...,2.0,1.0,465.0,NaN,NaN,Darebin,-37.74710,144.98770,Northern Metropolitan,14577.0

In [12]:
df.sample(2, random_state=None)

,Suburb,Address,Rooms,Type,Price,Method,SellerG,Date,Distance,Postcode,...,Bathroom,Car,Landsize,BuildingArea,YearBuilt,CouncilArea,Lattitude,Longtitude,Regionname,Propertycount
5143,Reservoir,39 Mason St,4,h,786000.0,S,Nelson,16/04/2016,11.2,3073.0,...,3.0,1.0,595.0,174.0,2013.0,Darebin,-37.7283,145.0072,Northern Metropolitan,21650.0
6127,Surrey Hills,89 Guildford Rd,4,h,2345000.0,S,Marshall,7/11/2016,11.2,3127.0,...,2.0,2.0,798.0,NaN,NaN,Boroondara,-37.8223,145.0954,Southern Metropolitan,5457.0

In [13]:
df.sample(random_state=42)

,Suburb,Address,Rooms,Type,Price,Method,SellerG,Date,Distance,Postcode,...,Bathroom,Car,Landsize,BuildingArea,YearBuilt,CouncilArea,Lattitude,Longtitude,Regionname,Propertycount
1061,Brighton,1a Mair St,3,h,2600000.0,S,Buxton,6/08/2016,11.2,3186.0,...,2.0,3.0,588.0,NaN,NaN,Bayside,-37.9287,144.992,Southern Metropolitan,10579.0

## Selecting Columns and Rows of a DataFrame

In [14]:
df['Rooms']

0        2
1        2
2        3
3        3
4        4
        ..
13575    4
13576    3
13577    3
13578    4
13579    4
Name: Rooms, Length: 13580, dtype: int64

In [15]:
columns_of_interest = ['Rooms', 'Price', 'Landsize']
selected_columns = df[columns_of_interest]
selected_columns

       Rooms      Price  Landsize
0          2  1480000.0     202.0
1          2  1035000.0     156.0
2          3  1465000.0     134.0
3          3   850000.0      94.0
4          4  1600000.0     120.0
...      ...        ...       ...
13575      4  1245000.0     652.0
13576      3  1031000.0     333.0
13577      3  1170000.0     436.0
13578      4  2500000.0     866.0
13579      4  1285000.0     362.0

[13580 rows x 3 columns]

In [17]:
numeric_columns = df.select_dtypes(include='number')
numeric_columns.head()

,Rooms,Price,Distance,Postcode,Bedroom2,Bathroom,Car,Landsize,BuildingArea,YearBuilt,Lattitude,Longtitude,Propertycount
0,2,1480000.0,2.5,3067.0,2.0,1.0,1.0,202.0,NaN,NaN,-37.7996,144.9984,4019.0
1,2,1035000.0,2.5,3067.0,2.0,1.0,0.0,156.0,79.0,1900.0,-37.8079,144.9934,4019.0
2,3,1465000.0,2.5,3067.0,3.0,2.0,0.0,134.0,150.0,1900.0,-37.8093,144.9944,4019.0
3,3,850000.0,2.5,3067.0,3.0,2.0,1.0,94.0,NaN,NaN,-37.7969,144.9969,4019.0
4,4,1600000.0,2.5,3067.0,3.0,1.0,2.0,120.0,142.0,2014.0,-37.8072,144.9941,4019.0

In [18]:
category_columns = df.select_dtypes(include='object')
category_columns.head()

,Suburb,Address,Type,Method,SellerG,Date,CouncilArea,Regionname
0,Abbotsford,85 Turner St,h,S,Biggin,3/12/2016,Yarra,Northern Metropolitan
1,Abbotsford,25 Bloomburg St,h,S,Biggin,4/02/2016,Yarra,Northern Metropolitan
2,Abbotsford,5 Charles St,h,SP,Biggin,4/03/2017,Yarra,Northern Metropolitan
3,Abbotsford,40 Federation La,h,PI,Biggin,4/03/2017,Yarra,Northern Metropolitan
4,Abbotsford,55a Park St,h,VB,Nelson,4/06/2016,Yarra,Northern Metropolitan

In [19]:
df.shape

(13580, 21)

In [20]:
df[1:3]

,Suburb,Address,Rooms,Type,Price,Method,SellerG,Date,Distance,Postcode,...,Bathroom,Car,Landsize,BuildingArea,YearBuilt,CouncilArea,Lattitude,Longtitude,Regionname,Propertycount
1,Abbotsford,25 Bloomburg St,2,h,1035000.0,S,Biggin,4/02/2016,2.5,3067.0,...,1.0,0.0,156.0,79.0,1900.0,Yarra,-37.8079,144.9934,Northern Metropolitan,4019.0
2,Abbotsford,5 Charles St,3,h,1465000.0,SP,Biggin,4/03/2017,2.5,3067.0,...,2.0,0.0,134.0,150.0,1900.0,Yarra,-37.8093,144.9944,Northern Metropolitan,4019.0

In [21]:
df[13575:]

,Suburb,Address,Rooms,Type,Price,Method,SellerG,Date,Distance,Postcode,...,Bathroom,Car,Landsize,BuildingArea,YearBuilt,CouncilArea,Lattitude,Longtitude,Regionname,Propertycount
13575,Wheelers Hill,12 Strada Cr,4,h,1245000.0,S,Barry,26/08/2017,16.7,3150.0,...,2.0,2.0,652.0,NaN,1981.0,NaN,-37.90562,145.16761,South-Eastern Metropolitan,7392.0
13576,Williamstown,77 Merrett Dr,3,h,1031000.0,SP,Williams,26/08/2017,6.8,3016.0,...,2.0,2.0,333.0,133.0,1995.0,NaN,-37.85927,144.87904,Western Metropolitan,6380.0
13577,Williamstown,83 Power St,3,h,1170000.0,S,Raine,26/08/2017,6.8,3016.0,...,2.0,4.0,436.0,NaN,1997.0,NaN,-37.85274,144.88738,Western Metropolitan,6380.0
13578,Williamstown,96 Verdon St,4,h,2500000.0,PI,Sweeney,26/08/2017,6.8,3016.0,...,1.0,5.0,866.0,157.0,1920.0,NaN,-37.85908,144.89299,Western Metropolitan,6380.0
13579,Yarraville,6 Agnes St,4,h,1285000.0,SP,Village,26/08/2017,6.3,3013.0,...,1.0,1.0,362.0,112.0,1920.0,NaN,-37.81188,144.88449,Western Metropolitan,6543.0

In [22]:
df[:5]

,Suburb,Address,Rooms,Type,Price,Method,SellerG,Date,Distance,Postcode,...,Bathroom,Car,Landsize,BuildingArea,YearBuilt,CouncilArea,Lattitude,Longtitude,Regionname,Propertycount
0,Abbotsford,85 Turner St,2,h,1480000.0,S,Biggin,3/12/2016,2.5,3067.0,...,1.0,1.0,202.0,NaN,NaN,Yarra,-37.7996,144.9984,Northern Metropolitan,4019.0
1,Abbotsford,25 Bloomburg St,2,h,1035000.0,S,Biggin,4/02/2016,2.5,3067.0,...,1.0,0.0,156.0,79.0,1900.0,Yarra,-37.8079,144.9934,Northern Metropolitan,4019.0
2,Abbotsford,5 Charles St,3,h,1465000.0,SP,Biggin,4/03/2017,2.5,3067.0,...,2.0,0.0,134.0,150.0,1900.0,Yarra,-37.8093,144.9944,Northern Metropolitan,4019.0
3,Abbotsford,40 Federation La,3,h,850000.0,PI,Biggin,4/03/2017,2.5,3067.0,...,2.0,1.0,94.0,NaN,NaN,Yarra,-37.7969,144.9969,Northern Metropolitan,4019.0
4,Abbotsford,55a Park St,4,h,1600000.0,VB,Nelson,4/06/2016,2.5,3067.0,...,1.0,2.0,120.0,142.0,2014.0,Yarra,-37.8072,144.9941,Northern Metropolitan,4019.0

## The loc Method

In [23]:
data = {
    'fruit': ['apple', 'banana', 'cherry', 'date'],
    'color': ['red', 'yellow', 'red', 'brown'],
    'weight': [120, 150, 45, 60]
}

In [24]:
df = pd.DataFrame(data, index = ['fruit1', 'fruit2', 'fruit3', 'fruit4'])
df

         fruit   color  weight
fruit1   apple     red     120
fruit2  banana  yellow     150
fruit3  cherry     red      45
fruit4    date   brown      60

In [25]:
single_row = df.loc['fruit2']
single_row

fruit     banana
color     yellow
weight       150
Name: fruit2, dtype: object

In [26]:
type(single_row)

pandas.core.series.Series

In [27]:
df.loc[:, 'fruit']

fruit1     apple
fruit2    banana
fruit3    cherry
fruit4      date
Name: fruit, dtype: object

In [30]:
df.loc[['fruit2', 'fruit4'], ['fruit', 'color']]

         fruit   color
fruit2  banana  yellow
fruit4    date   brown

## The iloc Method

In [31]:
df.iloc[0]

fruit     apple
color       red
weight      120
Name: fruit1, dtype: object

In [33]:
df.iloc[1:3]

         fruit   color  weight
fruit2  banana  yellow     150
fruit3  cherry     red      45

In [34]:
df.iloc[[0, 3]]

        fruit  color  weight
fruit1  apple    red     120
fruit4   date  brown      60

In [35]:
df.iloc[:, 0:2]

         fruit   color
fruit1   apple     red
fruit2  banana  yellow
fruit3  cherry     red
fruit4    date   brown

In [36]:
df.iloc[[1, 3], [0, 2]]

         fruit  weight
fruit2  banana     150
fruit4    date      60

## Adding and Removing Columns in a DataFrame

In [40]:
data = {
    'fruit': ['apple', 'banana', 'cherry', 'date'],
    'color': ['red', 'yellow', 'red', 'brown'],
    'weight': [120, 150, 45, 60]
}

In [41]:
df = pd.DataFrame(data)

In [42]:
new_column = [10, 20, 30, 40]
df['price'] = new_column
df

    fruit   color  weight  price
0   apple     red     120     10
1  banana  yellow     150     20
2  cherry     red      45     30
3    date   brown      60     40

In [43]:
new_columns = pd.DataFrame({
    'taste': ['sweet', 'sweet', 'sour', 'sweet'],
    'season': ['winter', 'summer', 'spring', 'autumn']
})

In [44]:
df = pd.concat([df, new_columns], axis=1)
df

    fruit   color  weight  price  taste  season
0   apple     red     120     10  sweet  winter
1  banana  yellow     150     20  sweet  summer
2  cherry     red      45     30   sour  spring
3    date   brown      60     40  sweet  autumn

In [45]:
df.drop('price', axis=1, inplace=True)
df

    fruit   color  weight  taste  season
0   apple     red     120  sweet  winter
1  banana  yellow     150  sweet  summer
2  cherry     red      45   sour  spring
3    date   brown      60  sweet  autumn

In [46]:
df1 = df.drop(0, axis=0, inplace=False)
df1

    fruit   color  weight  taste  season
1  banana  yellow     150  sweet  summer
2  cherry     red      45   sour  spring
3    date   brown      60  sweet  autumn

In [47]:
df.drop(['season', 'taste'], axis=1, inplace=True)
df

    fruit   color  weight
0   apple     red     120
1  banana  yellow     150
2  cherry     red      45
3    date   brown      60

## Adding and Removing Rows in a DataFrame

In [49]:
data = {
    'fruit': ['apple', 'banana', 'cherry'],
    'color': ['red', 'yellow', 'red'],
    'weight': [120, 150, 45]
}

df = pd.DataFrame(data)

In [50]:
df

    fruit   color  weight
0   apple     red     120
1  banana  yellow     150
2  cherry     red      45

In [51]:
new_row = pd.Series(['kiwi', 'green', 80], index=df.columns)
df.loc[len(df)] = new_row

In [52]:
df

    fruit   color  weight
0   apple     red     120
1  banana  yellow     150
2  cherry     red      45
3    kiwi   green      80

In [53]:
new_rows = pd.DataFrame([['grapes', 'green', 100], ['mango', 'yellow', 120]], columns=df.columns)
df = pd.concat([df, new_rows], ignore_index=True)
df

    fruit   color  weight
0   apple     red     120
1  banana  yellow     150
2  cherry     red      45
3    kiwi   green      80
4  grapes   green     100
5   mango  yellow     120

In [54]:
df.drop(index=2, inplace=True)
df

    fruit   color  weight
0   apple     red     120
1  banana  yellow     150
3    kiwi   green      80
4  grapes   green     100
5   mango  yellow     120

In [55]:
rows_to_remove = [1, 3]
df.drop(index=rows_to_remove, inplace=True)
df

    fruit   color  weight
0   apple     red     120
4  grapes   green     100
5   mango  yellow     120

In [57]:
df.drop(4, inplace=True)
df

   fruit   color  weight
0  apple     red     120
5  mango  yellow     120

## Renaming Columns in a DataFrame

In [58]:
data = {
    'fruit': ['apple', 'banana', 'cherry'],
    'color': ['red', 'yellow', 'red']
}

df = pd.DataFrame(data)
df

    fruit   color
0   apple     red
1  banana  yellow
2  cherry     red

In [59]:
df.rename(columns={'color': 'fruit_color'}, inplace=True)

In [60]:
df

    fruit fruit_color
0   apple         red
1  banana      yellow
2  cherry         red

## Reordering Columns in a DataFrame

In [61]:
data = {
    'fruit': ['apple', 'banana', 'cherry'],
    'color': ['red', 'yellow', 'red'],
    'weight': [120, 150, 45]
}

df = pd.DataFrame(data)
df

    fruit   color  weight
0   apple     red     120
1  banana  yellow     150
2  cherry     red      45

In [62]:
# Reordering columns using indexing
df = df[['color', 'weight', 'fruit']]
df

    color  weight   fruit
0     red     120   apple
1  yellow     150  banana
2     red      45  cherry

In [63]:
data = {
    'fruit': ['apple', 'banana', 'cherry'],
    'color': ['red', 'yellow', 'red'],
    'weight': [120, 150, 45]
}

df = pd.DataFrame(data)
df

    fruit   color  weight
0   apple     red     120
1  banana  yellow     150
2  cherry     red      45

In [64]:
# Reordering columns using reindex()
new_order = ['color', 'fruit', 'weight']
df = df.reindex(columns=new_order)
df

    color   fruit  weight
0     red   apple     120
1  yellow  banana     150
2     red  cherry      45

In [65]:
# Reordering columns using the loc[] indexer
df = df.loc[:, ['weight', 'color', 'fruit']]
df

   weight   color   fruit
0     120     red   apple
1     150  yellow  banana
2      45     red  cherry

In [66]:
# Reordering columns using the iloc[] indexer
df = df.iloc[:, [1, 0, 2]]
df

    color  weight   fruit
0     red     120   apple
1  yellow     150  banana
2     red      45  cherry

## Data Filtering Using Boolean Expressions

### Boolean Indexing

In [67]:
data = {
    'Name': ['John', 'Alice', 'Bob', 'Emily', 'Michael'],
    'Age': [30, 25, 35, 27, 32],
    'Department': ['HR', 'IT', 'IT', 'HR', 'Finance'],
    'Salary': [50000, 60000, 55000, 45000, 70000]
}

df = pd.DataFrame(data)
df

      Name  Age Department  Salary
0     John   30         HR   50000
1    Alice   25         IT   60000
2      Bob   35         IT   55000
3    Emily   27         HR   45000
4  Michael   32    Finance   70000

In [68]:
filtered_df = df[df['Age'] > 30]
filtered_df

      Name  Age Department  Salary
2      Bob   35         IT   55000
4  Michael   32    Finance   70000

In [69]:
filtered_df = df[(df['Age'] > 30) & (df['Department'] == 'IT')]
filtered_df

  Name  Age Department  Salary
2  Bob   35         IT   55000

In [70]:
filtered_df = df[df['Department'].str.startswith('H')]
filtered_df

    Name  Age Department  Salary
0   John   30         HR   50000
3  Emily   27         HR   45000

In [71]:
filtered_df = df[df['Department'].isin(['HR', 'Finance'])]
filtered_df

      Name  Age Department  Salary
0     John   30         HR   50000
3    Emily   27         HR   45000
4  Michael   32    Finance   70000

In [72]:
filtered_df = df[df['Salary'].isnull()]
filtered_df

Empty DataFrame
Columns: [Name, Age, Department, Salary]
Index: []

In [73]:
filtered_df = df[df['Salary'].notnull()]
filtered_df

      Name  Age Department  Salary
0     John   30         HR   50000
1    Alice   25         IT   60000
2      Bob   35         IT   55000
3    Emily   27         HR   45000
4  Michael   32    Finance   70000

## Arithmetic Operations on DataFrames

In [74]:
data = {
    'A': [1, 2, 3, 4, 5],
    'B': [10, 20, 30, 40, 50],
    'C': [100, 200, 300, 400, 500]
}

df = pd.DataFrame(data)
df

   A   B    C
0  1  10  100
1  2  20  200
2  3  30  300
3  4  40  400
4  5  50  500

In [75]:
df_add_scalar = df + 10
df_add_scalar

    A   B    C
0  11  20  110
1  12  30  210
2  13  40  310
3  14  50  410
4  15  60  510

In [81]:
df_add_df = df + df
df_add_df

    A    B     C
0   2   20   200
1   4   40   400
2   6   60   600
3   8   80   800
4  10  100  1000

In [82]:
df_multiply_df = df * df
df_multiply_df

    A     B       C
0   1   100   10000
1   4   400   40000
2   9   900   90000
3  16  1600  160000
4  25  2500  250000